app/controllers/tests_controller.rb

INSERT INTO "tests" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["body", "test"], ["created_at", "2016-04-02 17:13:09.073529"], ["updated_at", "2016-04-02 17:13:09.073529"]]
---
  def create
    @test = Test.new(test_params)

    respond_to do |format|
      if @test.save

SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_test
      @test = Test.find(params[:id])